Revit 2026 API
WireSizeSet Class
A set that contains wire sizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireSizeSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class WireSizeSet : APIObject,
	IEnumerable
Public Class WireSizeSet
	Inherits APIObject
	Implements IEnumerable
public ref class WireSizeSet : public APIObject,
	IEnumerable
type WireSizeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The WireSizeSet type exposes the following members.
Constructors
Name | Description
WireSizeSet | Initializes a new instance of the WireSizeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size | Returns the number of wire sizes that are in the set.
Top
Methods
Name | Description
Clear | Removes every wire size from the set, rendering it empty.
Contains | Tests for the existence of a wire size within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified wire size from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified wire size into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace